In [1]:
import pandas as pd
import numpy as np

In [2]:
student_performance = pd.read_csv('resources/StudentsPerformance.csv')

In [3]:
student_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
student_performance.describe() #описательные статистики для численных данных

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [5]:
student_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [6]:
student_performance.groupby('gender').aggregate({'writing score' : 'mean'}) #сгруппировать по полу и посчитать среднее

        writing score
gender
female      72.467181
male        63.311203

In [7]:
student_performance.shape

(1000, 8)

In [8]:
student_performance.size

8000

In [9]:
student_performance.iloc[0:3, 0:5] #выбираем табличку поменьше (integer location)

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [10]:
student_performance.iloc[[0, 3, 10], [0, 5, -1]] #-1 - это последняя

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [11]:
student_performance_with_names = student_performance.iloc[[0,3,4,7,8]]

In [12]:
student_performance_with_names.index=["Cersei", "Tywin", "Gregor", "Joffrey", "Ilyn Payne"]

In [13]:
student_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [14]:
student_performance_with_names.loc[['Cersei', 'Joffrey'], ['gender', 'writing score']]

         gender  writing score
Cersei   female             74
Joffrey    male             39

In [15]:
student_performance_with_names.iloc[:, 0]

Cersei        female
Tywin           male
Gregor          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [16]:
type(student_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [17]:
type(student_performance_with_names)

pandas.core.frame.DataFrame

In [18]:
type(student_performance_with_names.iloc[0])

pandas.core.series.Series

In [19]:
student_performance_with_names.iloc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: Cersei, dtype: object

In [20]:
my_series1 = pd.Series([1,2,3], index = ["Cersei", "Tywin", "Gregor"])
my_series2 = pd.Series([4,5,6], index = ["Cersei", "Tywin", "Gregor"])

In [21]:
pd.DataFrame({'col_name_1': my_series1, 'col_name_2': my_series2})

        col_name_1  col_name_2
Cersei           1           4
Tywin            2           5
Gregor           3           6

In [22]:
student_performance_with_names['gender'] #серия под именем gender

Cersei        female
Tywin           male
Gregor          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [23]:
student_performance_with_names[['gender']] #первая колонка фрейма

            gender
Cersei      female
Tywin         male
Gregor        male
Joffrey       male
Ilyn Payne    male

In [24]:
student_performance_with_names[['gender']].shape

(5, 1)

In [25]:
student_performance_with_names['gender'].shape

(5,)

In [26]:
student_performance_with_names.tail(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [27]:
student_performance.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [28]:
student_performance.iloc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [29]:
student_performance.loc[:6]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [30]:
student_performance_with_names.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [31]:
student_performance_with_names.dtypes.value_counts()

object    5
int64     3
Name: count, dtype: int64

In [32]:
student_performance_with_names.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [33]:
student_performance_with_names.shape

(5, 8)

In [34]:
student_performance_with_names.size

40

In [35]:
student_performance_with_names.index

Index(['Cersei', 'Tywin', 'Gregor', 'Joffrey', 'Ilyn Payne'], dtype='object')

In [36]:
student_performance_with_names.select_dtypes(include=['object'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course
Cersei,female,group B,bachelor's degree,standard,none
Tywin,male,group A,associate's degree,free/reduced,none
Gregor,male,group C,some college,standard,none
Joffrey,male,group B,some college,free/reduced,none
Ilyn Payne,male,group D,high school,free/reduced,completed

In [37]:
student_performance_with_names.select_dtypes(exclude=['object'])

            math score  reading score  writing score
Cersei              72             72             74
Tywin               47             57             44
Gregor              76             78             75
Joffrey             40             43             39
Ilyn Payne          64             64             67

In [38]:
titanic=pd.read_csv('resources/titanic.csv')

In [39]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
titanic.shape

(891, 12)

In [41]:
titanic.dtypes.value_counts()

int64      5
object     5
float64    2
Name: count, dtype: int64